src/InformationRegisters/РаботаСЯчейками/РаботаСЯчейками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботаСЯчейками</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРаботыСЯчейками</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Сканирования/Сканирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сканирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РаботаСЯчейками/ManagerModule.bsl
Процедура ЗарегистрироватьРаботуСЯчейкой(Ячейка, Статус, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Попытка
			Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Исключение
			Пользователь = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	МенЗаписи = РегистрыСведений.РаботаСЯчейками.СоздатьМенеджерЗаписи();
	МенЗаписи.Период = ТекущаяДата();
	МенЗаписи.Месяц = НачалоМесяца(МенЗаписи.Период);
	МенЗаписи.Пользователь = Пользователь;
	МенЗаписи.Ячейка = Ячейка;
	МенЗаписи.Статус = Статус;
	
	МенЗаписи.Записать(Истина);
КонецПроцедуры

Процедура УдалитьСтарыеДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сканирования.Месяц КАК Месяц
		|ИЗ
		|	РегистрСведений.Сканирования КАК Сканирования
		|ГДЕ
		|	Сканирования.Месяц < &ДатаСреза
		|
		|СГРУППИРОВАТЬ ПО
		|	Сканирования.Месяц";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДобавитьМесяц(ТекущаяДата(), -2));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборУдалить = РегистрыСведений.Сканирования.СоздатьНаборЗаписей();
		НаборУдалить.Отбор.Месяц.Установить(ВыборкаДетальныеЗаписи.Месяц);
		//НаборУдалить.Прочитать();
		НаборУдалить.Записать();
	КонецЦикла;
	
КонецПроцедуры
